---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.AreaLoadType
source: html/eda1c902-be67-51ed-80c9-21e7bfa8dc26.htm
---
# AreaLoadType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.